In [1]:
import pandas as pd

In [10]:
df=pd.read_csv("student_results.csv")
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,1,80
2,1003,10,3,8,2,1,60
3,1004,11,0,10,1,2,45
4,1005,11,4,11,2,3,75
5,1006,11,10,12,4,4,96
6,1007,12,4,6,5,5,80
7,1008,12,10,6,2,6,90
8,1009,12,2,8,3,7,60
9,1010,12,6,9,4,8,85

In [24]:
#loc

In [3]:
df.loc[0]

Date                      11/12/99
Student ID                  1001.0
Class                           10
Study hrs                        2
Sleeping hrs                   9.0
Social Media usage hrs           3
Mobile Games hrs               5.0
Percantege                      50
Name: 0, dtype: object

In [4]:
df.loc[9]

Date                      21/12/99
Student ID                  1010.0
Class                           12
Study hrs                        6
Sleeping hrs                   9.0
Social Media usage hrs           1
Mobile Games hrs               0.0
Percantege                      85
Name: 9, dtype: object

In [5]:
df.loc[[1,2]]

,Date,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
1,12/12/99,1002.0,10,6,8.0,2,0.0,80
2,13/12/99,NaN,10,3,8.0,2,4.0,60

In [6]:
df.loc[[2,4]]

,Date,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
2,13/12/99,NaN,10,3,8.0,2,4.0,60
4,16/12/99,1005.0,11,4,NaN,2,NaN,75

In [7]:
df.loc[4,'Class']

11

In [8]:
df.loc[0:3,'Class']

0    10
1    10
2    10
3    11
Name: Class, dtype: int64

In [18]:
df.loc[[True,True,True,True,False,True,True,True,True,False]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,1,80
2,1003,10,3,8,2,1,60
3,1004,11,0,10,1,2,45
5,1006,11,10,12,4,4,96
6,1007,12,4,6,5,5,80
7,1008,12,10,6,2,6,90
8,1009,12,2,8,3,7,60

In [20]:
df.loc[df['Class']<11]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,1,80
2,1003,10,3,8,2,1,60

In [23]:
df.loc[df['Class']<11,['Percantege']]

   Percantege
0          50
1          80
2          60

In [25]:
#iloc

In [27]:
df.iloc[0]

Student ID                1001
Class                       10
Study hrs                    2
Sleeping hrs                 9
Social Media usage hrs       3
Mobile Games hrs             5
Percantege                  50
Name: 0, dtype: int64

In [28]:
df.iloc[[0]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50

In [29]:
df.iloc[:,0]

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
7    1008
8    1009
9    1010
Name: Student ID, dtype: int64

In [30]:
df.iloc[[0,1]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,1,80